.emacs.d/myinit.el

;; A small performance improvement
(setq redisplay-dont-pause t)

;; Store all backups in a specific folder:
(setq backup-directory-alist `(("." . "~/file-bouncer/emacs-backups")))

;; Manual packages load path
(add-to-list 'load-path "~/my-dotfiles/.emacs.d/manual-packages/ob-elixir/")
(add-to-list 'load-path "~/my-dotfiles/.emacs.d/manual-packages/emacs-solargraph/")

;; Backup files by copying them
(setq backup-by-copying t)

;; Save my desktop
(desktop-save-mode 1)

;; I'm too lazy to type "yes" or "no"
(fset 'yes-or-no-p 'y-or-n-p)

;; Clean whitespace before saving a file
(add-hook 'before-save-hook (quote whitespace-cleanup))

;; Enable ido-mode (fewer keystrokes to switch buffers!)
(ido-mode 1)

;; ido-mode in the minibuffer
(icomplete-mode 1)

;; Enable windmove (switch windows with Shift+Arrow keys)
(when (fboundp 'windmove-default-keybindings)
    (windmove-default-keybindings))

;; Replace the built-in buffer menu with ibuffer
(global-set-key [24 2] (quote ibuffer))

;; Prevent the scratch buffer from being killed
(with-current-buffer "*scratch*"
    (emacs-lock-mode 'kill))

;; Set default font for Emacs
(set-frame-font "Ubuntu Mono 12")

;; Enable auto-revert-mode
(global-auto-revert-mode t)

;; Remove the menu bar in terminal mode
(when (not (display-graphic-p))
  (menu-bar-mode -1))

;; Org-babel - load ob-elixir
(load "ob-elixir")

;; Org-babel - load languages
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (sh . t)
   (python . t)
   (ruby . t)
   (elixir . t)
   (plantuml . t)
   (dot . t)
   ))

;; Use Bash as default shell interpreter
(setq org-babel-sh-command "/bin/bash")

;; Activate Company mode
(add-hook 'after-init-hook 'global-company-mode)

;; Enable global Abbrev mode
(setq-default abbrev-mode t)

;; Prog-mode is from where all the programming modes are derived from.
;; This means that if you call prog-mode-hook, the settings will be
;; applied to ALL programming modes in Emacs.
(add-hook 'prog-mode-hook 'linum-mode)
(add-hook 'text-mode-hook 'column-number-mode)

;; Ruby
;; Activate ruby-tools
(add-hook 'enh-ruby-mode-hook (quote ruby-tools-mode))

;; Create filling for org-mode
(add-hook 'org-mode-hook 'auto-fill-mode)

;; Use Weechat from Emacs
(require-package 'weechat)
;; Bind M-p to switch to previous buffer

;; Recreate scratch buffer
(defun create-scratch-buffer ()
  "create a scratch buffer"
  (interactive)
  (switch-to-buffer (get-buffer-create "*scratch*"))
  (org-mode)
  (insert initial-scratch-message)
  ;; Prevent the scratch buffer from being killed
  (with-current-buffer "*scratch*"
      (emacs-lock-mode 'kill)))

;; Unfill region, AKA leave single huge line
(defun unfill-region (beg end)
  "Unfill the region, joining text paragraphs into a single
  logical line.  This is useful, e.g., for use with
  `visual-line-mode'."
  (interactive "*r")
    (let ((fill-column (point-max)))
      (fill-region beg end)))

;; Call the live page reload script from within Emacs and bind it to a key
;; (defun css-live-reload-current-webpage ()
;;     (when (and (stringp buffer-file-name)
;;       (string-match "\\.scss\\'" buffer-file-name))
;;     (shell-command "~/my-dotfiles/bash/live-reload-firefox.sh")))

;; The original idea is to call this function when saving a stylesheet
;; (add-hook 'after-save-hook 'css-live-reload-current-webpage)

;; This is how you define aliases for Elisp functions
(defalias 'plp 'package-list-packages)

(use-package sass-mode
   ;; Set Sass mode for SASS files and Css mode for SCSS files.
   :config
   (add-to-list 'auto-mode-alist
  '("\\.sass\\'" . sass-mode)))

(use-package scss-mode

   :config
   (add-to-list 'auto-mode-alist
  '("\\.scss\\'" . scss-mode)))

(use-package js2-mode)

;; Set js2-mode as default mode for JS files
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

;; Set syntax highlight level
(setq js2-highlight-level 3)

(use-package php-mode)
;; Flymake support for PHP files
(use-package flymake-php)
(add-hook 'php-mode-hook 'flymake-php-load)

(use-package enh-ruby-mode)

;; Set it as default mode for Ruby files
(add-to-list 'auto-mode-alist
    '("\\(?:\\.rb\\|ru\\|rake\\|thor\\|jbuilder\\|gemspec\\|podspec\\|/\\(?:Gem\\|Rake\\|Cap\\|Thor\\|Vagrant\\|Guard\\|Pod\\)file\\)\\'"
    . enh-ruby-mode))

(require-package 'web-mode)

;; File associations
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))

;; Engine associations
(setq web-mode-engines-alist
    '(("php"    . "\\.phtml\\'")
    ("blade"  . "\\.blade\\."))
)

(use-package yaml-mode)

(use-package csv-mode)

(use-package projectile)
;; Enable it globally.
(add-hook 'after-init-hook #'projectile-global-mode)

(use-package autopair
   :init (autopair-global-mode))

(use-package emmet-mode)

(use-package highlight-numbers)
(add-hook 'prog-mode-hook 'highlight-numbers-mode)

(use-package flycheck
   :config
   ;; turn on flychecking globally
   (add-hook 'after-init-hook #'global-flycheck-mode))

(use-package ruby-tools)

;; Ensure it's loaded
(use-package engine-mode)
;; Activate it
(engine-mode t)

;; Define search engines to use
(defengine github
    "https://github.com/search?ref=simplesearch&q=%s"
    :keybinding "g")
(defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")
(defengine youtube
    "https://www.youtube.com/results?search_query=%s"
    :keybinding "y")
(defengine stackoverflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")



(use-package evil-leader)
(global-evil-leader-mode)
;; Evil mode needs to be loaded after evil-leader
(use-package evil)
(evil-mode 1)

;; Load configs
(load "~/my-dotfiles/.emacs.d/evilrc")

(use-package evil-surround)
(global-evil-surround-mode)

(require-package 'helm)
(require 'helm-config)
(helm-mode 1)

;; Bind the keys I want:
(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "»") 'helm-M-x)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x b") 'helm-buffers-list)

;; Complete with tab in Helm buffer, remap action menu to C-tab
(define-key helm-map (kbd "<tab>") 'hippie-expand)
(define-key helm-map (kbd "C-<tab>") 'helm--action-prompt)

;; Enable fuzzy matching
(setq helm-M-x-fuzzy-match t)
