.emacs.d/myinit.org
*** Company
    *COMPlete ANYthing* inside Emacs.
    I switched to it because it works in GUI Emacs and auto-complete doesn't.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (require-package 'company)

    ;; Add Tern to Company
    (require-package 'company-tern)
    (require-package 'tern)

    ;; Call that inside js2-mode and add tern to company backends
    (defun tern-mode-tweaks ()
    (add-to-list 'company-backends 'company-tern)
    (tern-mode 1))
    (add-hook 'js2-mode-hook 'tern-mode-tweaks)
    ;; Autocompletion for Bootstrap/FontAwesome classes
    (require-package 'ac-html-bootstrap)

    ;; Web-mode completions
    (require-package 'company-web)

    ;; Add web-mode completions when started
    (require 'company-web-html)

    ;; Company statistics package
    (use-package company-statistics)
    (company-statistics-mode)

    ;; Company with prescient.el offers better sorting of completion candidates.
    ;; I don't know if it clashes with company-statistics.
    (use-package company-prescient)

    ;; Activate it
    (company-prescient-mode)
    #+END_SRC
*** Keyfreq
    Shows most used commands in editing session.
    To see the data, run (keyfreq-show) with M-:
    #+BEGIN_SRC emacs-lisp :tangle yes
    (require-package 'keyfreq)

    ;; Ignore arrow commands and self-insert-commands
    (setq keyfreq-excluded-commands
    '(self-insert-command
    org-self-insert-command
    abort-recursive-edit
    forward-char
    backward-char
    previous-line
    next-line))

    ;; Activate it
    (keyfreq-mode 1)
    (keyfreq-autosave-mode 1)
    #+END_SRC
*** Diminish
    Free some space in the mode line removing superfluous mode indications.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package diminish
       ;; These are loaded at startup
       :diminish helm-mode
       :diminish company-mode
       :diminish undo-tree-mode
       :diminish auto-revert-mode
       :diminish auto-fill-function
       :diminish abbrev-mode
       :diminish autopair-mode)
    ;; These are loaded at other moments
    (eval-after-load "editorconfig" '(diminish 'editorconfig-mode))
    (eval-after-load "yasnippet" '(diminish 'yas-minor-mode))
    (eval-after-load "projectile" '(diminish 'projectile-mode))
    #+END_SRC
*** Editorconfig
    Helps developers define and maintain consistent coding styles
    between different editors and IDEs.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package editorconfig
       :init
       ;; Activate it.
       (editorconfig-mode 1))
    #+END_SRC
*** Nyan-mode
    Put a Nyan Cat in your mode line! :3
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package nyan-mode)
    (nyan-mode 1)
    #+END_SRC
*** Mode Icons
    Indicate modes in the mode line using icons
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package mode-icons
       :init
       (mode-icons-mode))
    #+END_SRC
*** Emojify
    Add emoji support for Emacs
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package emojify)
    #+END_SRC
** Utilities
*** Helm-projectile
    Browse through Projectile commands using Helm.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package helm-projectile)
    #+END_SRC
*** Ibuffer-projectile
    Enables filtering buffers by project.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package ibuffer-projectile)
    #+END_SRC
*** Camcorder
    Record editing sessions in Emacs.
    Invoke with M-x camcorder-record, pause with F11 and finish with
    F12.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package camcorder)
    #+END_SRC
*** Rainbow Delimiters
    Highlight parentheses, brackets and braces according to their
    depth.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package rainbow-delimiters)
    ;; Add this to prog-mode
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
    #+END_SRC
*** Smart Mode Line
    Prettier mode line.
    You can activate it with M-x sml/setup.
    #+BEGIN_SRC emacs-lisp :tangle yes
    ;; Smart-mode-line depends on powerline
    (require-package 'powerline)
    (require 'powerline)
    ;; (require-package 'smart-mode-line)

    #+END_SRC
*** Web-beautify
    Format HTML/CSS and JS code with js-beautify
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package web-beautify)
    #+END_SRC
*** Magit
    How to win at Git from Emacs.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package magit)
    #+END_SRC
*** Eshell configurations
    #+BEGIN_SRC emacs-lisp :tangle yes
    ;; Eshell extras
    (use-package eshell-prompt-extras)

    ;; More configs
    (with-eval-after-load "esh-opt"
    (autoload 'epe-theme-lambda "eshell-prompt-extras")
    (setq eshell-highlight-prompt t
    eshell-prompt-function 'epe-theme-lambda))
    #+END_SRC
*** Yasnippets
    It originally came with company-mode, it's handy to write faster
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package yasnippet-snippets)
    #+END_SRC
*** Theme Changer
    Change current theme depending on time of the day
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package theme-changer
       :config
       (progn ;; Set the location
       (setq calendar-location-name "Curitiba, PR")
       (setq calendar-latitude -25.41)
       (setq calendar-longitude -49.25)

       ;; Specify the day and night themes:
       (change-theme 'whiteboard 'fairyfloss)))
    #+END_SRC
*** Ace Jump Mode
    Move to any word with 2 keypresses.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package ace-jump-mode)
    #+END_SRC
*** Robe
    Ruby's autocomplete, navigation and project tools, especially for
    Rails.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package robe)
    (add-hook 'enh-ruby-mode-hook 'robe-mode)

    ;; Integrate with Company
    (eval-after-load 'company '(push 'company-robe company-backends))
    #+END_SRC
*** RVM
    Ruby Version Manager. Akin to python's virtualenv.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package rvm)
    #+END_SRC
*** Anzu
    Show search result count in the mode line.
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package evil-anzu)
    (global-anzu-mode)
    #+END_SRC
*** Vagrant TRAMP
    Open files in running Vagrant box using TRAMP
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package vagrant-tramp)
    #+END_SRC

* Themes
** Moe
   Light and dark theme, with some extra stuff.
   Comes with support for smart-mode-line.
   #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package moe-theme)
   #+END_SRC
** Abyss
   Dark contrast theme
   #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package abyss-theme)
   #+END_SRC
* Mode Line
** Moe Modeline Themes
   Use moe-theme's powerline support instead of sml
   #+BEGIN_SRC emacs-lisp :tangle yes
   ;; Show highlighted buffer-id as decoration. (Default: nil)
   (setq moe-theme-highlight-buffer-id t)

   ;; Activate SML
   ;; (sml/setup t)
   ;; Choose a color for the mode line (Default: blue)
   (powerline-moe-theme)
   (moe-theme-set-color 'purple)
   #+END_SRC
* Graphical
#+BEGIN_SRC emacs-lisp :tangle yes
;; Set font in graphical mode
(when (display-graphic-p)
    ;; Use Fantasque Sans Mono when available
    (if (member "Fantasque Sans Mono" (font-family-list))
    (set-frame-font "Fantasque Sans Mono 12")
    '(set-frame-font "Ubuntu Mono 12" nil t))
    ;; Remove menu and scroll bars in graphical mode
    (menu-bar-mode 0)
    (tool-bar-mode 0)
    (scroll-bar-mode 0)
    ;; Enable emoji images
    (global-emojify-mode)
    ;; Enable them in the mode line as well.
    (global-emojify-mode-line-mode)
    ;; Maximize frame on startup
    (toggle-frame-maximized))
#+END_SRC
* Keybindings
#+BEGIN_SRC emacs-lisp :tangle yes
;; Remapping the help hotkey so it doesn't clash with Unix backspace.
;; Whenever you want to call help you can use M-x help as well. F1
;; works too.
(define-key key-translation-map [?\C-h] [?\C-?])

;; Unfill region
(define-key global-map "\C-\M-q" 'unfill-region)

;; Switch to last buffer - I do it all the time
(global-set-key [27 112] (quote mode-line-other-buffer))

;; Mapping AltGr-d to delete-other-windows,
;; Another symbol I don't use often.
(global-set-key [240] (quote delete-other-windows))

;; Access buffers with Alt-Gr b
(global-set-key [8221] (quote ido-switch-buffer))

;; Map the Home and End keys to go to the beginning and end of the buffer
(global-set-key [home] (quote beginning-of-buffer))
(global-set-key [end] (quote end-of-buffer))

;; Move to beginning of line or indentation
(defun back-to-indentation-or-beginning () (interactive)
  (if (= (point) (progn (back-to-indentation) (point)))
      (beginning-of-line)))

(global-set-key (kbd "C-a") (quote back-to-indentation-or-beginning))

;; Hippie-Expand: change key to M-SPC; Replace dabbrev-expand
(global-set-key "\M- " 'hippie-expand)
(global-set-key "\M-/" 'hippie-expand)

;; Eshell - bind M-p to go back to previous buffer
(defun eshell-tweaks ()
    "Keybindings for the Emacs shell"
    (local-set-key (kbd "M-p") 'switch-to-prev-buffer)
    "Start in Emacs mode"
    (evil-set-initial-state 'eshell-mode 'emacs))
(add-hook 'eshell-mode-hook 'eshell-tweaks)

;; Set C-x j to go to current clocked task in org-mode
(global-set-key (kbd "C-x j") 'org-clock-goto)

#+END_SRC
* Web-mode
#+BEGIN_SRC emacs-lisp :tangle yes
(defun web-mode-keybindings ()
    "Define mode-specific keybindings like this."
    (local-set-key (kbd "C-c C-v") 'browse-url-of-buffer)
    (local-set-key (kbd "C-c /") 'sgml-close-tag))

;; Add company backends when loading web-mode.
(defun web-mode-company-load-backends ()
    (company-web-bootstrap+)
    (company-web-fa+))

(add-hook 'web-mode-hook 'web-mode-keybindings)
(add-hook 'web-mode-hook 'web-mode-company-load-backends)
#+END_SRC
