.emacs.d/myinit.el

(require-package 'company)

;; Add Tern to Company
(require-package 'company-tern)
(require-package 'tern)

;; Call that inside js2-mode and add tern to company backends
(defun tern-mode-tweaks ()
    (add-to-list 'company-backends 'company-tern)
    (tern-mode 1))
(add-hook 'js2-mode-hook 'tern-mode-tweaks)
;; Autocompletion for Bootstrap/FontAwesome classes
(require-package 'ac-html-bootstrap)

;; Web-mode completions
(require-package 'company-web)

;; Add web-mode completions when started
(require 'company-web-html)

;; Company statistics package
(use-package company-statistics)
(company-statistics-mode)

(require-package 'keyfreq)

;; Ignore arrow commands and self-insert-commands
(setq keyfreq-excluded-commands
    '(self-insert-command
    org-self-insert-command
    abort-recursive-edit
    forward-char
    backward-char
    previous-line
    next-line))

;; Activate it
(keyfreq-mode 1)
(keyfreq-autosave-mode 1)

(use-package diminish
   ;; These are loaded at startup
   :diminish helm-mode
   :diminish company-mode
   :diminish undo-tree-mode
   :diminish auto-revert-mode
   :diminish auto-fill-function
   :diminish abbrev-mode
   :diminish autopair-mode)
;; These are loaded at other moments
(eval-after-load "editorconfig" '(diminish 'editorconfig-mode))
(eval-after-load "yasnippet" '(diminish 'yas-minor-mode))
(eval-after-load "projectile" '(diminish 'projectile-mode))

(use-package editorconfig
   :init
   ;; Activate it.
   (editorconfig-mode 1))

(use-package nyan-mode)
(nyan-mode 1)

(use-package mode-icons
   :init
   (mode-icons-mode))

(use-package emojify)

(use-package rainbow-delimiters)
;; Add this to prog-mode
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

;; Smart-mode-line depends on powerline
(require-package 'powerline)
(require 'powerline)
(require-package 'smart-mode-line)

(use-package web-beautify)

(use-package magit)

;; Eshell extras
(use-package eshell-prompt-extras)

;; More configs
(with-eval-after-load "esh-opt"
(autoload 'epe-theme-lambda "eshell-prompt-extras")
(setq eshell-highlight-prompt t
    eshell-prompt-function 'epe-theme-lambda))

(use-package yasnippet-snippets)

(use-package theme-changer
   :config
   (progn ;; Set the location
   (setq calendar-location-name "Curitiba, PR")
   (setq calendar-latitude -25.41)
   (setq calendar-longitude -49.25)

   ;; Specify the day and night themes:
   (change-theme 'whiteboard 'fairyfloss)))

(use-package ace-jump-mode)

(use-package moe-theme)

;; Show highlighted buffer-id as decoration. (Default: nil)
(setq moe-theme-highlight-buffer-id t)

;; Activate SML
(sml/setup)
;; Choose a color for the mode line (Default: blue)
(powerline-moe-theme)
(moe-theme-set-color 'purple)

;; Set font in graphical mode
(when (display-graphic-p)
    ;; Use Fantasque Sans Mono when available
    (if (member "Fantasque Sans Mono" (font-family-list))
    (set-frame-font "Fantasque Sans Mono 12")
    '(set-frame-font "Ubuntu Mono 12" nil t))
    ;; Remove menu and scroll bars in graphical mode
    (menu-bar-mode 0)
    (tool-bar-mode 0)
    (scroll-bar-mode 0)
    ;; Enable emoji images
    (global-emojify-mode)
    ;; Maximize frame on startup
    (toggle-frame-maximized))

;; Remapping the help hotkey so it doesn't clash with Unix backspace.
;; Whenever you want to call help you can use M-x help as well. F1
;; works too.
(define-key key-translation-map [?\C-h] [?\C-?])

;; Unfill region
(define-key global-map "\C-\M-q" 'unfill-region)

;; Switch to last buffer - I do it all the time
(global-set-key [27 112] (quote mode-line-other-buffer))

;; Mapping AltGr-d to delete-other-windows,
;; Another symbol I don't use often.
(global-set-key [240] (quote delete-other-windows))

;; Access buffers with Alt-Gr b
(global-set-key [8221] (quote ido-switch-buffer))

;; Map the Home and End keys to go to the beginning and end of the buffer
(global-set-key [home] (quote beginning-of-buffer))
(global-set-key [end] (quote end-of-buffer))

;; Move to beginning of line or indentation
(defun back-to-indentation-or-beginning () (interactive)
  (if (= (point) (progn (back-to-indentation) (point)))
      (beginning-of-line)))

(global-set-key (kbd "C-a") (quote back-to-indentation-or-beginning))

;; Hippie-Expand: change key to M-SPC; Replace dabbrev-expand
(global-set-key "\M- " 'hippie-expand)
(global-set-key "\M-/" 'hippie-expand)

;; Eshell - bind M-p to go back to previous buffer
(defun eshell-tweaks ()
    "Keybindings for the Emacs shell"
    (local-set-key (kbd "M-p") 'switch-to-prev-buffer)
    "Start in Emacs mode"
    (evil-set-initial-state 'eshell-mode 'emacs))
(add-hook 'eshell-mode-hook 'eshell-tweaks)

;; Set C-x j to go to current clocked task in org-mode
(global-set-key (kbd "C-x j") 'org-clock-goto)

(defun web-mode-keybindings ()
    "Define mode-specific keybindings like this."
    (local-set-key (kbd "C-c C-v") 'browse-url-of-buffer)
    (local-set-key (kbd "C-c /") 'sgml-close-tag))

;; Add company backends when loading web-mode.
(defun web-mode-company-load-backends ()
    (company-web-bootstrap+)
    (company-web-fa+))

(add-hook 'web-mode-hook 'web-mode-keybindings)
(add-hook 'web-mode-hook 'web-mode-company-load-backends)
