.emacs.d/myinit.org
* Org-mode
#+BEGIN_SRC emacs-lisp :tangle yes
;; We don't need Flycheck in org-mode buffers. Usually.
(add-hook 'org-mode-hook '(lambda() (flycheck-mode 0)))

;; Bind org-capture to C-c c
(global-set-key (kbd "\C-c c") (quote org-capture))

;; Bind org-pomodoro to C-x p
(global-set-key (kbd "\C-x p") (quote org-pomodoro))

;; Open the agenda with C-c a
(global-set-key [3 97] (quote org-agenda))

;; Open subheading with C-c RET and invert with M-RET
(local-set-key [27 13] (quote org-ctrl-c-ret))
(local-set-key [3 13] (quote org-insert-subheading))

;; Org-agenda: point the files you want it to read
;; (setq org-agenda-files (list "~/file-bouncer/org-files/contact-based-system/"))

;; Always respect the content of a heading when creating todos!
(local-set-key [M-S-return] (quote org-insert-todo-heading-respect-content))

;; Map C-S-enter to org-insert-todo-subheading
(local-set-key [C-S-return] (quote org-insert-todo-subheading))

#+END_SRC
** Org-bullets
   Change org-mode's *s to UTF-8 chars
   #+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-bullets
      :init
      (add-hook 'org-mode-hook (lambda() (org-bullets-mode 1))))
   #+END_SRC
** Org-babel
*** Elixir
    #+BEGIN_SRC emacs-lisp :tangle yes
    (use-package ob-elixir)
    #+END_SRC
*** Load languages
   #+BEGIN_SRC emacs-lisp :tangle yes
     (org-babel-do-load-languages
     'org-babel-load-languages
     '(
     ;; (sh . t)
    (python . t)
    (ruby . t)
    (elixir . t)
    (plantuml . t)
    (dot . t)
     ))
   #+END_SRC


* Variables
#+BEGIN_SRC emacs-lisp :tangle yes
;; Set Org mode as default mode for new buffers:
(setq-default major-mode 'org-mode)

;; Enable auto-fill mode by default
(auto-fill-mode 1)

;; Set default fill to 79
(set-fill-column 79)

;; Set line number mode and column number mode for code files
(line-number-mode 1)

;; Change tab width and change tabs to spaces
(setq-default tab-width 4)
(setq-default indent-tabs-mode nil)

;; Making Emacs auto-indent
(define-key global-map (kbd "RET") 'newline-and-indent)

;; Shows trailing whitespace, if any:
(setq-default show-trailing-whitespace t)
;; Don't do that for terminal mode!
(add-hook 'multi-term-mode-hook (setq-default show-trailing-whitespace nil))

(defun css-mode-tweaks()
  (emmet-mode 1)
  (rainbow-mode 1))

;; Emmet-mode: activate for html-mode, sgml-mode,
;; css-mode, web-mode and sass-mode
(add-hook 'sgml-mode-hook 'emmet-mode)
(add-hook 'sass-mode-hook 'css-mode-tweaks)
(add-hook 'web-mode-hook 'emmet-mode)

;; By the way, it's nice to add rainbow-mode for CSS
(add-hook 'css-mode-hook 'css-mode-tweaks)

;; Python: use python3 as default shell interpreter
(setq python-shell-interpreter "python3")

#+END_SRC
* Macros
#+BEGIN_SRC emacs-lisp :tangle yes
;; To save a macro, record it with C-x ( (start) and C-x ) (stop),
;; give it a name with C-x C-k n (C-k is for maKro) and
;; insert it in this file with insert-kbd-macro.
;; Then you execute it mapping it to a key! 😊

;; Example macro: Mark todos as done
(fset 'org-mark-as-done
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("d" 0 "%d")) arg)))
#+END_SRC
* Twittering mode
  Use Twitter from within Emacs!
  #+BEGIN_SRC emacs-lisp :tangle yes
  (use-package twittering-mode
      :bind (("C-c r" . twittering-reply-to-user)
             ("C-c f" . twittering-favorite)
             ("C-c n" . twittering-native-retweet)))

    ;; Adjust update interval in seconds. It's timeR, not time!
    (setq twittering-timer-interval 3600)

    ;; Display icons (if applicable)
    (setq twittering-icon-mode t)

    ;; Use a master password so you don't have to ask for authentication every time
    (setq twittering-use-master-password t)
  #+END_SRC

  #+RESULTS:
  : t
* Packages saved for later need
** Perspective
# ** Perspective
#    Switch between named "perspectives" of the editor.
#    #+BEGIN_SRC emacs-lisp :tangle yes
#    (use-package perspective)
#    (persp-mode)
#    #+END_SRC
